src/org/fixing-programmatic-tool-calling-with-types.org
#+TITLE:Fixing Programmatic Tool Calling With Types
#+DATE: 2026-03-10 13:37
#+TAGS: OCaml, Type Theory, Large Language Models, Programming Languages
#+OPTIONS: toc:nil num:nil
#+HAUNT_BASE_DIR: /home/hack/Documents/Code/Guile/blog

Anthropic recently introduced [[https://platform.claude.com/docs/en/agents-and-tools/tool-use/programmatic-tool-calling][Programmatic Tool Calling]], which lets Large Language Models write Python programs to orchestrate multiple tool calls with loops, conditionals, and error handling. It is a very powerful method to have an agent run a huge number of tool calls without filling up its context window, and also avoid the latency of the usual call-one-tool-at-a-time loop.

This approach works great in demos, however it runs into a number of issues in production, and they all have the same root cause: Python is /too expressive/ for this job. I created a small, /restricted/ programming language called [[https://github.com/matchcase/lambda-tool][λ-Tool]] in OCaml to solve this problem, and it catches four common tool calling issues at *compile time*, before a single tool call is made.

* The Issues

Say you have a support agent. A customer writes in: "I was charged twice." The LLM looks up the account, issues a refund, sends a reply. Here's the Python code it generates:
#+BEGIN_SRC python
account = await lookup_account(ticket.customer_id)
refund = await issue_refund({
    "account_id": account["id"],
    "amount": account["last_charge_cents"]
})
await send_reply({
    "to": account["email"],
    "body": f"Refund of ${refund['amount'] / 100:.2f} processed. "
            f"Transaction: {refund['tx_id']}"
})
#+END_SRC

This passes the sandbox. Every test succeeds. And yet, it has /at least/ three bugs:

- *Wrong field*
  The account record has ~subscription_tier~. The LLM writes ~account["plan"]~ somewhere in the conditional logic. The mock returns a dict with everything the test expects, so the ~KeyError~ never fires. In production it crashes, but only after side effects have already happened.

- *Double write*
  ~issue_refund~ succeeds but the response times out. The LLM's error handling retries the call. The refund went through on the first attempt. Now the customer has been refunded twice.
#+BEGIN_SRC python
try:
    refund = await issue_refund({"account_id": acct_id, "amount": 4999})
except TimeoutError:
    refund = await issue_refund({"account_id": acct_id, "amount": 4999})
#+END_SRC

- *Unhandled failure*
  The reply gets sent even when the refund fails, because ~send_reply~ isn't conditional on ~issue_refund~ succeeding. The customer gets an email saying "your refund has been processed" when it hasn't.

The same bugs show up everywhere LLMs compose tools. An incident response bot retries a deployment rollback on timeout, re-deploying the broken version. A meeting bot creates a Jira ticket, the call fails, but sends a Slack message referencing the ticket key anyway. Wrong fields, unhandled errors, unsafe retry, unbounded loops.

