src/posts/fixing-programmatic-tool-calling-with-types.html
title: Fixing Programmatic Tool Calling With Types
date: 2026-03-10 13:37
tags: OCaml, Type Theory, Large Language Models, Programming Languages
---
<p>
Anthropic recently introduced <a href="https://platform.claude.com/docs/en/agents-and-tools/tool-use/programmatic-tool-calling">Programmatic Tool Calling</a>, which lets Large Language Models write Python programs to orchestrate multiple tool calls with loops, conditionals, and error handling. It is a very powerful method to have an agent run a huge number of tool calls without filling up its context window, and also avoid the latency of the usual call-one-tool-at-a-time loop.
</p>

<p>
This approach works great in demos, however it runs into a number of issues in production, and they all have the same root cause: Python is <i>too expressive</i> for this job. I created a small, <i>restricted</i> programming language called <a href="https://github.com/matchcase/lambda-tool">λ-Tool</a> in OCaml to solve this problem, and it catches four common tool calling issues at <b>compile time</b>, before a single tool call is made.
</p>
<div id="outline-container-orge1dcca9" class="outline-2">
<h2 id="orge1dcca9">The Issues</h2>
<div class="outline-text-2" id="text-orge1dcca9">
<p>
Say you have a support agent. A customer writes in: "I was charged twice." The LLM looks up the account, issues a refund, sends a reply. Here's the Python code it generates:
</p>
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #a0a0cf;">account</span><span style="color: #a0a0cf;"> = </span><span style="color: #a0a0cf;">await</span><span style="color: #a0a0cf;"> lookup_account(</span><span style="color: #e4b8c6;">ticket.customer_id</span><span style="color: #a0a0cf;">)</span>
<span style="color: #a0a0cf;">refund</span><span style="color: #a0a0cf;"> = </span><span style="color: #a0a0cf;">await</span><span style="color: #a0a0cf;"> issue_refund(</span><span style="color: #e4b8c6;">{</span>
    <span style="color: #dadae665d6d6;">"account_id"</span><span style="color: #b5ccad;">: account[</span><span style="color: #f9f9dededede;">"id"</span><span style="color: #b5ccad;">],
    </span><span style="color: #dadae665d6d6;">"amount"</span><span style="color: #b5ccad;">: account[</span><span style="color: #f9f9dededede;">"last_charge_cents"</span><span style="color: #b5ccad;">]</span>
<span style="color: #e4b8c6;">}</span><span style="color: #a0a0cf;">)</span>
<span style="color: #a0a0cf;">await</span><span style="color: #a0a0cf;"> send_reply(</span><span style="color: #e4b8c6;">{</span>
    <span style="color: #dadae665d6d6;">"to"</span><span style="color: #b5ccad;">: account[</span><span style="color: #f9f9dededede;">"email"</span><span style="color: #b5ccad;">],
    </span><span style="color: #dadae665d6d6;">"body"</span><span style="color: #b5ccad;">: f</span><span style="color: #dadae665d6d6;">"Refund of $</span><span style="color: #dadae665d6d6;">{</span><span style="color: #dadae665d6d6;">refund[</span><span style="color: #dadae665d6d6;">'amount'</span><span style="color: #dadae665d6d6;">] / </span><span style="color: #dadae665d6d6;">100</span><span style="color: #dadae665d6d6;">:.2f</span><span style="color: #dadae665d6d6;">}</span><span style="color: #dadae665d6d6;"> processed. "</span>
            <span style="color: #b5ccad;">f</span><span style="color: #dadae665d6d6;">"Transaction: </span><span style="color: #dadae665d6d6;">{</span><span style="color: #dadae665d6d6;">refund[</span><span style="color: #dadae665d6d6;">'tx_id'</span><span style="color: #dadae665d6d6;">]</span><span style="color: #dadae665d6d6;">}</span><span style="color: #dadae665d6d6;">"</span>
<span style="color: #e4b8c6;">}</span><span style="color: #a0a0cf;">)</span>
</code></pre>
</div>

<p>
This passes the sandbox. Every test succeeds. And yet, it has <i>at least</i> three bugs:
</p>

<ul class="org-ul">
<li><b>Wrong field</b>
The account record has <code>subscription_tier</code>. The LLM writes <code>account["plan"]</code> somewhere in the conditional logic. The mock returns a dict with everything the test expects, so the <code>KeyError</code> never fires. In production it crashes, but only after side effects have already happened.</li>

<li><b>Double write</b>
<code>issue_refund</code> succeeds but the response times out. The LLM's error handling retries the call. The refund went through on the first attempt. Now the customer has been refunded twice.</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #a0a0cf;">try</span><span style="color: #a0a0cf;">:
    </span><span style="color: #a0a0cf;">refund</span><span style="color: #a0a0cf;"> = </span><span style="color: #a0a0cf;">await</span><span style="color: #a0a0cf;"> issue_refund(</span><span style="color: #e4b8c6;">{</span><span style="color: #dadae665d6d6;">"account_id"</span><span style="color: #b5ccad;">: acct_id, </span><span style="color: #dadae665d6d6;">"amount"</span><span style="color: #b5ccad;">: </span><span style="color: #b5ccad;">4999</span><span style="color: #e4b8c6;">}</span><span style="color: #a0a0cf;">)</span>
<span style="color: #a0a0cf;">except</span><span style="color: #a0a0cf;"> </span><span style="color: #a0a0cf;">TimeoutError</span><span style="color: #a0a0cf;">:
    </span><span style="color: #a0a0cf;">refund</span><span style="color: #a0a0cf;"> = </span><span style="color: #a0a0cf;">await</span><span style="color: #a0a0cf;"> issue_refund(</span><span style="color: #e4b8c6;">{</span><span style="color: #dadae665d6d6;">"account_id"</span><span style="color: #b5ccad;">: acct_id, </span><span style="color: #dadae665d6d6;">"amount"</span><span style="color: #b5ccad;">: </span><span style="color: #b5ccad;">4999</span><span style="color: #e4b8c6;">}</span><span style="color: #a0a0cf;">)</span>
</code></pre>
</div>

<ul class="org-ul">
<li><b>Unhandled failure</b>
The reply gets sent even when the refund fails, because <code>send_reply</code> isn't conditional on <code>issue_refund</code> succeeding. The customer gets an email saying "your refund has been processed" when it hasn't.</li>
</ul>

<p>
The same bugs show up everywhere LLMs compose tools. An incident response bot retries a deployment rollback on timeout, re-deploying the broken version. A meeting bot creates a Jira ticket, the call fails, but sends a Slack message referencing the ticket key anyway. Wrong fields, unhandled errors, unsafe retry, unbounded loops.
</p>
</div>
</div>
