src/posts/fixing-programmatic-tool-calling-with-types.html
<div id="outline-container-orgdcffeaa" class="outline-2">
<h2 id="orgdcffeaa">λ-Tool</h2>
<div class="outline-text-2" id="text-orgdcffeaa">
<p>
<a href="https://github.com/matchcase/lambda-tool">λ-Tool</a> makes these four bugs compile-time type errors; the LLM generates λ-Tool code instead of Python, then a type checker verifies the code before any tool runs. If the code is wrong, the LLM gets a type error, fixes it, and resubmits. Nothing executed, so the retry is free.
</p>

<p>
Here's the same support agent in λ-Tool:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #a0a0cf;">tool lookup_account: </span><span style="color: #a0a0cf;">String</span><span style="color: #a0a0cf;"> -{</span><span style="color: #e4b8c6;">Read</span><span style="color: #a0a0cf;">}-&gt; {</span><span style="color: #e4b8c6;">id: </span><span style="color: #e4b8c6;">String</span><span style="color: #e4b8c6;">, subscription_tier: </span><span style="color: #e4b8c6;">String</span><span style="color: #e4b8c6;">,
                                       email: </span><span style="color: #e4b8c6;">String</span><span style="color: #e4b8c6;">, last_charge_cents: </span><span style="color: #e4b8c6;">Int</span><span style="color: #a0a0cf;">};
tool issue_refund: {</span><span style="color: #e4b8c6;">account_id: </span><span style="color: #e4b8c6;">String</span><span style="color: #e4b8c6;">, amount: </span><span style="color: #e4b8c6;">Int</span><span style="color: #a0a0cf;">}</span> <span style="color: #a0a0cf;">-{</span><span style="color: #e4b8c6;">Write</span><span style="color: #a0a0cf;">}-&gt; {</span><span style="color: #e4b8c6;">tx_id: </span><span style="color: #e4b8c6;">String</span><span style="color: #a0a0cf;">};
tool send_reply: {</span><span style="color: #e4b8c6;">to</span><span style="color: #e4b8c6;">: </span><span style="color: #e4b8c6;">String</span><span style="color: #e4b8c6;">, body: </span><span style="color: #e4b8c6;">String</span><span style="color: #a0a0cf;">}</span> <span style="color: #a0a0cf;">-{</span><span style="color: #e4b8c6;">Write</span><span style="color: #a0a0cf;">}-&gt; </span><span style="color: #a0a0cf;">Unit</span><span style="color: #a0a0cf;">;

</span><span style="color: #a0a0cf;">match</span><span style="color: #a0a0cf;"> exec tool lookup_account </span><span style="color: #f3a0a0;">"cust_12345"</span> <span style="color: #a0a0cf;">{</span>
  <span style="color: #e4b8c6;">Ok</span><span style="color: #e4b8c6;">(</span><span style="color: #b5ccad;">account</span><span style="color: #e4b8c6;">)</span> <span style="color: #e4b8c6;">=&gt;
    </span><span style="color: #e4b8c6;">match</span><span style="color: #e4b8c6;"> exec tool issue_refund {</span><span style="color: #b5ccad;">account_id = account.id,
                                   amount = account.last_charge_cents</span><span style="color: #e4b8c6;">}</span> <span style="color: #e4b8c6;">{</span>
      <span style="color: #b5ccad;">Ok</span><span style="color: #b5ccad;">(</span><span style="color: #f3bdbd;">refund</span><span style="color: #b5ccad;">)</span> <span style="color: #b5ccad;">=&gt;
        </span><span style="color: #b5ccad;">match</span><span style="color: #b5ccad;"> exec tool send_reply {</span><span style="color: #f3bdbd;">to</span><span style="color: #f3bdbd;"> = account.email,
                                     body = refund.tx_id</span><span style="color: #b5ccad;">}</span> <span style="color: #b5ccad;">{</span>
          <span style="color: #f3bdbd;">Ok</span><span style="color: #f3bdbd;">(</span><span style="color: #d1c0bb;">u</span><span style="color: #f3bdbd;">)</span> <span style="color: #f3bdbd;">=&gt; </span><span style="color: #f9f9dededede;">"refund processed and customer notified"</span><span style="color: #f3bdbd;">,
          </span><span style="color: #f3bdbd;">Err</span><span style="color: #f3bdbd;">(</span><span style="color: #d1c0bb;">e</span><span style="color: #f3bdbd;">)</span> <span style="color: #f3bdbd;">=&gt; </span><span style="color: #f9f9dededede;">"refund succeeded but notification failed"</span>
        <span style="color: #b5ccad;">},
      </span><span style="color: #b5ccad;">Err</span><span style="color: #b5ccad;">(</span><span style="color: #f3bdbd;">e</span><span style="color: #b5ccad;">)</span> <span style="color: #b5ccad;">=&gt; </span><span style="color: #dadae665d6d6;">"refund failed, customer not refunded"</span>
    <span style="color: #e4b8c6;">},
  </span><span style="color: #e4b8c6;">Err</span><span style="color: #e4b8c6;">(</span><span style="color: #b5ccad;">e</span><span style="color: #e4b8c6;">)</span> <span style="color: #e4b8c6;">=&gt; </span><span style="color: #f271dc5be362;">"account lookup failed"</span>
<span style="color: #a0a0cf;">}</span>
</code></pre>
</div>

<p>
Every tool declares its input type, output type, and effects (<code>Read</code>, <code>Write</code>). The types are how the checker knows what fields exist. If the LLM writes <code>account.plan</code>, it gets:
</p>
<pre class="example" id="org00e2af9">
Field 'plan' not found in record type
  {id: String, subscription_tier: String, email: String, last_charge_cents: Int}
</pre>

<p>
Every <code>exec</code> returns a <code>Result</code>. The only way to use it is <code>match ... { Ok(x) =&gt; ..., Err(e) =&gt; ... }</code>. The type checker rejects any program that uses a Result without matching both branches. <code>send_reply</code> is nested inside <code>Ok(refund)</code>, so it only runs if the refund succeeded. In the <code>Err</code> branch, <code>refund</code> doesn't exist as a variable, so the LLM can't reference data from a failed call.
</p>

<p>
There is no retry mechanism. <code>exec tool issue_refund ...</code> evaluates exactly once, and the language has no <code>try/except</code>, no <code>while</code>, no recursion. You can't write a retry loop because the syntax doesn't <i>allow</i> it.
</p>

<p>
Iteration is bounded: <code>map</code>, <code>filter</code>, <code>fold</code> over finite lists; these require pure callbacks. Trying to call a tool inside <code>map</code> is a type error:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #a0a0cf;">tool charge: {</span><span style="color: #e4b8c6;">id: </span><span style="color: #e4b8c6;">Int</span><span style="color: #e4b8c6;">, amount: </span><span style="color: #e4b8c6;">Int</span><span style="color: #a0a0cf;">}</span> <span style="color: #a0a0cf;">-{</span><span style="color: #e4b8c6;">Write</span><span style="color: #a0a0cf;">}-&gt; {</span><span style="color: #e4b8c6;">tx_id: </span><span style="color: #e4b8c6;">String</span><span style="color: #a0a0cf;">};

map (</span><span style="color: #e4b8c6;">fn o: {</span><span style="color: #b5ccad;">id: </span><span style="color: #b5ccad;">Int</span><span style="color: #b5ccad;">, amount: </span><span style="color: #b5ccad;">Int</span><span style="color: #e4b8c6;">}</span><span style="color: #a9c99f;"> </span><span style="color: #e4b8c6;">=&gt; exec tool charge o</span><span style="color: #a0a0cf;">)</span>
    <span style="color: #a0a0cf;">[</span><span style="color: #e4b8c6;">{</span><span style="color: #b5ccad;">id = 1, amount = 100</span><span style="color: #e4b8c6;">}</span><span style="color: #a0a0cf;">]</span>
<span style="color: #a0a0cf;">(</span><span style="color: #e4b8c6;">* </span><span style="color: #e4b8c6;">Effect violation: allowed {}</span><span style="color: #a0a0cf;"> </span><span style="color: #e4b8c6;">but got {</span><span style="color: #b5ccad;">Write</span><span style="color: #e4b8c6;">}</span><span style="color: #a0a0cf;"> </span><span style="color: #e4b8c6;">*</span><span style="color: #a0a0cf;">)</span>
</code></pre>
</div>

<p>
Effectful iteration uses <code>traverse</code>, which short-circuits on the first error and forces Result handling:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #a0a0cf;">match</span><span style="color: #a0a0cf;"> traverse (</span><span style="color: #e4b8c6;">fn o: {</span><span style="color: #b5ccad;">id: </span><span style="color: #b5ccad;">Int</span><span style="color: #b5ccad;">, amount: </span><span style="color: #b5ccad;">Int</span><span style="color: #e4b8c6;">}</span><span style="color: #a9c99f;"> </span><span style="color: #e4b8c6;">=&gt;
    exec tool charge o
  </span><span style="color: #a0a0cf;">)</span> <span style="color: #a0a0cf;">[</span><span style="color: #e4b8c6;">{</span><span style="color: #b5ccad;">id = 1, amount = 100</span><span style="color: #e4b8c6;">}</span><span style="color: #a0a0cf;">]</span> <span style="color: #a0a0cf;">{</span>
  <span style="color: #e4b8c6;">Ok</span><span style="color: #e4b8c6;">(</span><span style="color: #b5ccad;">receipts</span><span style="color: #e4b8c6;">)</span> <span style="color: #e4b8c6;">=&gt; </span><span style="color: #f271dc5be362;">"done"</span><span style="color: #e4b8c6;">,
  </span><span style="color: #e4b8c6;">Err</span><span style="color: #e4b8c6;">(</span><span style="color: #b5ccad;">e</span><span style="color: #e4b8c6;">)</span> <span style="color: #e4b8c6;">=&gt; e
</span><span style="color: #a0a0cf;">}</span>
</code></pre>
</div>

<p>
Unlike Python-based Programmatic Tool Calling implementations, λ-Tool does not require a sandbox because the restrictiveness <i>is</i> the sandbox.
</p>
</div>
</div>
