src/org/fixing-programmatic-tool-calling-with-types.org
* Why Types

The idea of restricting a language to prevent errors goes back to Alonzo Church, who [[https://plato.stanford.edu/entries/type-theory-church/][added types to his lambda calculus]] in 1940 specifically to forbid nonsense like applying a number to a number. The typed version could express fewer programs, and yet that was the point: the programs you lose are exactly the ones you don't want. Robin Milner took this further with ML, adding type inference and mandatory pattern matching, so the compiler could prove you'd handled every case before the code ran. The [[https://cs3110.github.io/textbook/chapters/adv/curry-howard.html][Curry-Howard correspondence]] formalized why this works: types are propositions, programs are proofs, and a type checker is a proof checker. When λ-Tool rejects a program that doesn't handle ~Err~, it's rejecting an incomplete proof.

Each of λ-Tool's four guarantees comes from a specific result in this lineage. Row types, from Didier Rémy's work extending ML records in the early 90s, give us field safety: ~{id: String, email: String}~ means exactly those fields, and accessing anything else is a compile-time error. Mandatory Result matching is just ML's exhaustive pattern matching applied to tool calls, and bounded iteration (no ~while~, no recursion) gives guaranteed termination.

The double-write problem, on the other hand, needed something newer. Jean-Yves Girard's [[https://ncatlab.org/nlab/show/linear+logic][linear logic]] introduced the idea that a fact can be used exactly once: when you use it, it's consumed. λ-Tool's ~!T~ annotation applies this to values:
#+BEGIN_SRC ocaml
fn token: !String => let a = token in let b = token in a
(* Linearity violation for 'token': used 2 times (must be exactly once) *)
#+END_SRC

A refund token, an API nonce, a deployment rollback: these are resources that should be consumed exactly once. Linear types enforce that at compile time.

Jane Street routes hundreds of billions of dollars through OCaml, a direct descendant of ML, because its type system catches at compile time what would be runtime crashes in Python. λ-Tool applies the same tradition to the problem of tool composition by language models.

* Results

I ran both Claude Sonnet and Haiku against 8 PTC tasks, generating both Python and λ-Tool. Both models generated valid λ-Tool on the first try over 96% of the time. The remaining ~4% were parse errors, caught instantly before any tool runs.

In this experiment, every λ-Tool program that parsed also typed correctly, and every program that typed correctly executed without errors. The Python programs all ran without exceptions too, but that's the problem: several of them contained silent double-write bugs that the sandbox didn't catch. λ-Tool rejected the same patterns at compile time.

The full experiment setup and results are in the [[https://github.com/matchcase/lambda-tool/raw/main/paper/main.pdf][paper]].

* Implementation

[[https://github.com/matchcase/lambda-tool][λ-Tool]] is ~2,500 lines of OCaml, containing a lexer, parser, bidirectional type checker, and interpreter. The type checker has 178 tests across three suites, plus 200,000 QCheck-generated random well-typed programs, with zero counterexamples of the type system's guarantees.

The [[https://github.com/matchcase/lambda-tool-python][Python package]] wraps the OCaml CLI:
#+BEGIN_SRC python
from lambda_tool import LambdaTool

lt = LambdaTool()

# Type-check -- no execution, no side effects
check = lt.typecheck(code)

# Execute with real tool implementations
result = lt.run(code, executors={
    "lookup_account": real_account_api,
    "issue_refund": real_refund_api,
    "send_reply": real_email_api,
})
#+END_SRC

[[https://github.com/matchcase/minilambda][minilambda]] is a basic (~200 LoC) demo agent that uses this Python package for tool calling. Claude generates λ-Tool code, the type checker verifies it, the interpreter executes it with real Python callbacks. It processes a batch of orders, which includes charging cards and sending receipts, with a simulated ~30% card decline rate. The type system forces Claude to handle the failures, because the code won't compile otherwise.

* Links

- [[https://github.com/matchcase/lambda-tool][λ-Tool]]: OCaml type checker and interpreter
- [[https://github.com/matchcase/lambda-tool-python][lambda-tool-python]]: Python package
- [[https://github.com/matchcase/minilambda][minilambda]]: minimal working agent
- [[https://github.com/matchcase/lambda-tool/raw/main/paper/main.pdf][Paper]]: full type system and proofs
- [[https://github.com/matchcase/lambda-tool/blob/main/skill.md][skill.md]]: the prompt that teaches Claude to generate λ-Tool code

* About Me

My name is [[https://blog.coldboot.org/about][Sarthak]] and I like using cross-disciplinary techniques to solve interesting problems. The ivory tower has many spires, and I like building bridges that connect them. If you have something interesting that you would like me to work on, please feel free to [[mailto:shahsarthakw@gmail.com][reach out]].
