src/posts/fixing-programmatic-tool-calling-with-types.html
<div id="outline-container-org38b855b" class="outline-2">
<h2 id="org38b855b">Why Types</h2>
<div class="outline-text-2" id="text-org38b855b">
<p>
The idea of restricting a language to prevent errors goes back to Alonzo Church, who <a href="https://plato.stanford.edu/entries/type-theory-church/">added types to his lambda calculus</a> in 1940 specifically to forbid nonsense like applying a number to a number. The typed version could express fewer programs, and yet that was the point: the programs you lose are exactly the ones you don't want. Robin Milner took this further with ML, adding type inference and mandatory pattern matching, so the compiler could prove you'd handled every case before the code ran. The <a href="https://cs3110.github.io/textbook/chapters/adv/curry-howard.html">Curry-Howard correspondence</a> formalized why this works: types are propositions, programs are proofs, and a type checker is a proof checker. When λ-Tool rejects a program that doesn't handle <code>Err</code>, it's rejecting an incomplete proof.
</p>

<p>
Each of λ-Tool's four guarantees comes from a specific result in this lineage. Row types, from Didier Rémy's work extending ML records in the early 90s, give us field safety: <code>{id: String, email: String}</code> means exactly those fields, and accessing anything else is a compile-time error. Mandatory Result matching is just ML's exhaustive pattern matching applied to tool calls, and bounded iteration (no <code>while</code>, no recursion) gives guaranteed termination.
</p>

<p>
The double-write problem, on the other hand, needed something newer. Jean-Yves Girard's <a href="https://ncatlab.org/nlab/show/linear+logic">linear logic</a> introduced the idea that a fact can be used exactly once: when you use it, it's consumed. λ-Tool's <code>!T</code> annotation applies this to values:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #a0a0cf;">fn token: </span><span style="color: #a0a0cf;">!</span><span style="color: #a0a0cf;">String</span><span style="color: #a0a0cf;"> =&gt; </span><span style="color: #a0a0cf;">let</span><span style="color: #a0a0cf;"> </span><span style="color: #a0a0cf;">a</span><span style="color: #a0a0cf;"> = token </span><span style="color: #a0a0cf;">in</span><span style="color: #a0a0cf;"> </span><span style="color: #a0a0cf;">let</span><span style="color: #a0a0cf;"> </span><span style="color: #a0a0cf;">b</span><span style="color: #a0a0cf;"> = token </span><span style="color: #a0a0cf;">in</span><span style="color: #a0a0cf;"> a
</span><span style="color: #a0a0cf;">(</span><span style="color: #e4b8c6;">* </span><span style="color: #e4b8c6;">Linearity violation for 'token': used 2 times (</span><span style="color: #b5ccad;">must be exactly once</span><span style="color: #e4b8c6;">)</span><span style="color: #a0a0cf;"> </span><span style="color: #e4b8c6;">*</span><span style="color: #a0a0cf;">)</span>
</code></pre>
</div>

<p>
A refund token, an API nonce, a deployment rollback: these are resources that should be consumed exactly once. Linear types enforce that at compile time.
</p>

<p>
Jane Street routes hundreds of billions of dollars through OCaml, a direct descendant of ML, because its type system catches at compile time what would be runtime crashes in Python. λ-Tool applies the same tradition to the problem of tool composition by language models.
</p>
</div>
</div>
<div id="outline-container-org29bc187" class="outline-2">
<h2 id="org29bc187">Results</h2>
<div class="outline-text-2" id="text-org29bc187">
<p>
I ran both Claude Sonnet and Haiku against 8 PTC tasks, generating both Python and λ-Tool. Both models generated valid λ-Tool on the first try over 96% of the time. The remaining ~4% were parse errors, caught instantly before any tool runs.
</p>

<p>
In this experiment, every λ-Tool program that parsed also typed correctly, and every program that typed correctly executed without errors. The Python programs all ran without exceptions too, but that's the problem: several of them contained silent double-write bugs that the sandbox didn't catch. λ-Tool rejected the same patterns at compile time.
</p>

<p>
The full experiment setup and results are in the <a href="https://github.com/matchcase/lambda-tool/raw/main/paper/main.pdf">paper</a>.
</p>
</div>
</div>
<div id="outline-container-orgf104852" class="outline-2">
<h2 id="orgf104852">Implementation</h2>
<div class="outline-text-2" id="text-orgf104852">
<p>
<a href="https://github.com/matchcase/lambda-tool">λ-Tool</a> is ~2,500 lines of OCaml, containing a lexer, parser, bidirectional type checker, and interpreter. The type checker has 178 tests across three suites, plus 200,000 QCheck-generated random well-typed programs, with zero counterexamples of the type system's guarantees.
</p>

<p>
The <a href="https://github.com/matchcase/lambda-tool-python">Python package</a> wraps the OCaml CLI:
</p>
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #a0a0cf;">from</span><span style="color: #a0a0cf;"> lambda_tool </span><span style="color: #a0a0cf;">import</span><span style="color: #a0a0cf;"> LambdaTool

</span><span style="color: #a0a0cf;">lt</span><span style="color: #a0a0cf;"> = LambdaTool()</span>

<span style="color: #a0a0cf;"># Type-check -- no execution, no side effects</span>
<span style="color: #a0a0cf;">check</span><span style="color: #a0a0cf;"> = lt.typecheck(</span><span style="color: #e4b8c6;">code</span><span style="color: #a0a0cf;">)</span>

<span style="color: #a0a0cf;"># Execute with real tool implementations</span>
<span style="color: #a0a0cf;">result</span><span style="color: #a0a0cf;"> = lt.run(</span><span style="color: #e4b8c6;">code, executors={</span>
    <span style="color: #dadae665d6d6;">"lookup_account"</span><span style="color: #b5ccad;">: real_account_api,
    </span><span style="color: #dadae665d6d6;">"issue_refund"</span><span style="color: #b5ccad;">: real_refund_api,
    </span><span style="color: #dadae665d6d6;">"send_reply"</span><span style="color: #b5ccad;">: real_email_api,
</span><span style="color: #e4b8c6;">}</span><span style="color: #a0a0cf;">)</span>
</code></pre>
</div>

<p>
<a href="https://github.com/matchcase/minilambda">minilambda</a> is a basic (~200 LoC) demo agent that uses this Python package for tool calling. Claude generates λ-Tool code, the type checker verifies it, the interpreter executes it with real Python callbacks. It processes a batch of orders, which includes charging cards and sending receipts, with a simulated ~30% card decline rate. The type system forces Claude to handle the failures, because the code won't compile otherwise.
</p>
</div>
</div>
<div id="outline-container-org18e63ca" class="outline-2">
<h2 id="org18e63ca">Links</h2>
<div class="outline-text-2" id="text-org18e63ca">
<ul class="org-ul">
<li><a href="https://github.com/matchcase/lambda-tool">λ-Tool</a>: OCaml type checker and interpreter</li>
<li><a href="https://github.com/matchcase/lambda-tool-python">lambda-tool-python</a>: Python package</li>
<li><a href="https://github.com/matchcase/minilambda">minilambda</a>: minimal working agent</li>
<li><a href="https://github.com/matchcase/lambda-tool/raw/main/paper/main.pdf">Paper</a>: full type system and proofs</li>
<li><a href="https://github.com/matchcase/lambda-tool/blob/main/skill.md">skill.md</a>: the prompt that teaches Claude to generate λ-Tool code</li>
</ul>
</div>
</div>
<div id="outline-container-org3d8ee96" class="outline-2">
<h2 id="org3d8ee96">About Me</h2>
<div class="outline-text-2" id="text-org3d8ee96">
<p>
My name is <a href="https://blog.coldboot.org/about">Sarthak</a> and I like using cross-disciplinary techniques to solve interesting problems. The ivory tower has many spires, and I like building bridges that connect them. If you have something interesting that you would like me to work on, please feel free to <a href="mailto:shahsarthakw@gmail.com">reach out</a>.
</p>
</div>
</div>
